/*+++

	Copyright (c) Aerotech Inc., 1996 - 2006

	This header file is an  PUBLIC Aerotech A3200 include file, and is used by
	all (Win apps, device drivers, library, firmware).
	and must also be included by all customer apps (library, SDK, VB).

	NOTE:	A change will usually mean a change in two or three places at once, as data is stored in
			parallel here. For example adding a task parameter means a change in both the TASKPARM_
			constants, and a change in the TaskParmInfo data structure. Especially true when changing
			status constants, when you may need to change 4 places or so.

	NOTE:	This file is auto generated.  Changes made to this file will be lost the next time the
			file is generated.

+++*/


#ifndef __AERPINFO_H__
#define __AERPINFO_H__

#include "aerbld.rc"  /* for version numbers */
#include "AerPDef.h"

#include <float.h>
#include <limits.h>

#define  MAX_PARM_NAME_LEN    40

/*** Status word definitions ***************************************************************************/
//
// TO MAKE A CHANGE IN THESE YOU MUST CHANGE ALL THE BELOW PLACES IN PARALLEL ! :
// See FIRST set (bit names) for comments on bit meanings
//    1. (AERPINFO.H) Structure members (to allow easy bit access to the bits)
//         (change both the bit numbers and the masks)
//    2. (AERPINFO.H) Names for the bits (used by NStat, etc.)
//    3. (AERPDEF.H) Bit numbers
//    4. (INI/AERPARAM.PGM) CNC bit numbers
//         (change the bit numbers, there are no masks)

   "NormalcyActiveRight",              /* 17 */
   "NormalcyAlignment",                /* 18 performing a normalcy alignment move */
   "MotionTypeCW",                     /* 19 G2 mode */
   "MotionTypeCCW",                    /* 20 G3 mode */
   "LimitFeedRateActive",              /* 21 MaxFeedRate speed limit being applied */
   "LimitMFOActive",                   /* 22 MFO being limited, due to MaxFeedRate/Blend* speed limit */
   "Coord1Plane1",                     /* 23 G17 (I,J) */
   "Coord1Plane2",                     /* 24 G18 (K,I) */
   "Coord1Plane3",                     /* 25 G19 (J,K) */
   "Coord2Plane1",                     /* 26 G27 (I,J) */
   "Coord2Plane2",                     /* 27 G28 (K,I) */
   "Coord2Plane3",                     /* 28 G29 (J,K) */
   "NewG1",                            /* 29 */
   "MirrorActive",                     /* 30 G83 (mirroring) active */
   "Spare2"                            /* 31 */          // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
};
CHAR  szTaskModeName[MAX_TASKMODE_DWORD*32][MAX_PARM_NAME_LEN]=
{
   /* TASKMODE1_ */
   "English",                          /*  0 - !Metric (G70/G71) */
   "Absolute",                         /*  1 - !Incremental (G90/G91) */
   "AccelModeLinear",                  /*  2 - !1-cosine (G63/G64) */
   "AccelModeRate",                    /*  3 - !Time based (G67/G68) */
   "RotaryDominant",                   /*  4 - !Linear (G98/G99) */
   "MotionContinuous",                 /*  5 - !DecelToZero (G9/G109/G108) */
   "InverseCircular",                  /*  6 - (G110/G111) */
   "SpindleStopOnProgHalt",            /*  7 - (G100/G101) */
   "BlockDelete",                      /*  8 - (G112/G113) */
   "OptionalStop",                     /*  9 - (G114/G115) */
   "AccelModeScurve",                  /* 10 */
   "MFOLock",                          /* 11 */
   "MSOLock",                          /* 12 */
   "DryRunFeedRate",                   /* 13 - (G116/G117) */
   "Spare",                            /* 14 */
   "AutoMode",                         /* 15 !StepMode */
   "ProgramFeedRateMPU",               /* 16 */
   "ProgramFeedRateUPR",               /* 17 */
   "ProgramSFeedRateSurf1",            /* 18 */
   "ProgramSFeedRateSurf2",            /* 19 */
   "ProgramSFeedRateSurf3",            /* 20 */
   "ProgramSFeedRateSurf4",            /* 21 */
   "BlockDelete2",                     /* 22 - (G212/G213) */
   "RunOverMode",                      /* 23 !Into */
   "MultiBlockLookAhead",              /* 24 - (G300/G301) */
   "HighSpeedLookAhead",               /* 25 - (M41/M42)   */
   "MFOActiveOnJog",                   /* 26 - (G120/G121) */
   "WaitForInPos",                     /* 27 - (G360/G361) */
   "Minutes",                          /* 28 - (G75/G76)   */
   "Counts",                           /* 29 */
   "WaitNone",                         /* 30 */
   "Spare",                            /* 31 */   // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
};
#endif

/* TASKPARM_Status structure */
typedef struct tagAER_TASK_STATUS
{
   union
   {
      DWORD    dwMask;
      struct
      {
         unsigned ProgramAssociated:1;                /*  0 */
         unsigned ProgramActive:1;                    /*  1 */
         unsigned ProgramExecuting:1;                 /*  2 */
         unsigned ImmediateCodeExecuting:1;           /*  3 */
         unsigned ReturnMotionExecuting:1;            /*  4 */
         unsigned ProgramAborted:1;                   /*  5 */
         unsigned SingleStepInto:1;                   /*  6 */
         unsigned SingleStepOver:1;                   /*  7 */
         unsigned ProgramReset:1;                     /*  8 */
         unsigned PendingAxesStop:1;                  /*  9 */
         unsigned EStopActive:1;                      /* 10 */
         unsigned FeedHoldActive:1;                   /* 11 */
         unsigned CallBackHoldActive:1;               /* 12 */
         unsigned CallBackResponding:1;               /* 13 */
         unsigned SpindleActive:MAX_SPINDLES;         /* 14->17 */
         unsigned ProbeCycle:1;                       /* 18 */
         unsigned Retrace:1;                          /* 19 */
         unsigned SoftHomeActive:1;                   /* 20 */
         unsigned InterruptMotionActive:1;            /* 21 */
         unsigned SlewActive:1;                       /* 22 */
         unsigned CornerRounding:1;                   /* 23 */
         unsigned ROReq1Active:1;                     /* 24 */
         unsigned SlewLowFeedModeActive:1;            /* 25 */
         unsigned CannedFunctionActive:1;             /* 26 */
         unsigned CannedFunctionExecuting:1;          /* 27 */
         unsigned Spare3:1;                           /* 28 */
         unsigned Spare4:1;                           /* 29 */
         unsigned Spare5:1;                           /* 30 */
         unsigned Spare6:1;                           /* 31 */     // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
      } Bit;
   } DW1;

   union
   {
      DWORD    dwMask;
      struct
      {
         unsigned MotionModeAbsOffsets:1;             /*  0 */
         unsigned ASyncSMCMotionAbortPending:1;       /*  1 */
         unsigned ProfileQueRunning:1;                /*  2 */
         unsigned RetraceRequested:1;                 /*  3 */
         unsigned MSOChange:1;                        /*  4 */
         unsigned SpindleFeedHeld:1;                  /*  5 */
         unsigned FeedHeldAxesStopped:1;              /*  6 */
         unsigned CutterEnabling:1;                   /*  7 */
         unsigned CutterDisabling:1;                  /*  8 */
         unsigned CutterOffsetsEnablingPos:1;         /*  9 */
         unsigned CutterOffsetsEnablingNeg:1;         /* 10 */
         unsigned CutterOffsetsDisabling:1;           /* 11 */
         unsigned MFOChange:1;                        /* 12 */
         unsigned InterruptFaultPending:1;            /* 13 */
         unsigned RetraceNegativeHold:1;              /* 14 */
         unsigned OnGosubPending:1;                   /* 15 */
         unsigned ProgramAbortPending:1;              /* 16 */
         unsigned CannedFunctionPending:1;            /* 17 */
         unsigned NoMFOFloor:1;                       /* 18 */
         unsigned Interrupted:1;                      /* 19 */
         unsigned ProgramStepOnce:1;                  /* 20 */
         unsigned Spare9:1;                           /* 21 */
         unsigned Spare10:1;                          /* 22 */
         unsigned Spare11:1;                          /* 23 */
         unsigned Spare12:1;                          /* 24 */
         unsigned Spare13:1;                          /* 25 */
         unsigned Spare14:1;                          /* 26 */
         unsigned Spare15:1;                          /* 27 */
         unsigned Spare16:1;                          /* 28 */
         unsigned Spare17:1;                          /* 29 */
         unsigned Spare18:1;                          /* 30 */
         unsigned Spare19:1;                          /* 31 */     // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
      } Bit;
   } DW2;

   union
   {
      DWORD    dwMask;
      struct
      {
         unsigned RotationActive:1;                   /*  0 */
         unsigned RThetaPolarActive:1;                /*  1 */
         unsigned RThetaCylindricalActive:1;          /*  2 */
         unsigned ScalingActive:1;                    /*  3 */
         unsigned OffsetFixtureActive:1;              /*  4 */
         unsigned ProfileActive:1;                    /*  5 */
         unsigned MotionTypePtToPt:1;                 /*  6 */
         unsigned MotionTypeInterp:1;                 /*  7 */
         unsigned MotionTypeProfilePoint:1;           /*  8 */
         unsigned MotionContinuous:1;                 /*  9 */
         unsigned MotionNoAccel:1;                    /* 10 */
         unsigned VppActive:1;                           /* 11 */
         unsigned CutterOffsetsActivePos:1;           /* 12 */
         unsigned CutterActiveLeft:1;                 /* 13 */
         unsigned CutterActiveRight:1;                /* 14 */
         unsigned CutterOffsetsActiveNeg:1;           /* 15 */
         unsigned NormalcyActiveLeft:1;               /* 16 */
         unsigned NormalcyActiveRight:1;              /* 17 */
         unsigned NormalcyAlignment:1;                /* 18 */
         unsigned MotionTypeCW:1;                     /* 19 */
         unsigned MotionTypeCCW:1;                    /* 20 */
         unsigned LimitFeedRateActive:1;              /* 21 */
         unsigned LimitMFOActive:1;                   /* 22 */
         unsigned Coord1Plane1:1;                     /* 23 */
         unsigned Coord1Plane2:1;                     /* 24 */
         unsigned Coord1Plane3:1;                     /* 25 */
         unsigned Coord2Plane1:1;                     /* 26 */
         unsigned Coord2Plane2:1;                     /* 27 */
         unsigned Coord2Plane3:1;                     /* 28 */
         unsigned NewG1:1;                            /* 29 */
         unsigned MirrorActive:1;                     /* 30 */
         unsigned Spare3:1;                           /* 31 */    // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
      } Bit;
   } DW3;
} AER_TASK_STATUS;
typedef AER_TASK_STATUS *PAER_TASK_STATUS;
typedef const AER_TASK_STATUS *const PCAER_TASK_STATUS;

/* TASKPARM_Mode1 structure */
typedef struct tagAER_TASK_MODE
{
   union
   {
      DWORD    dwMask;
      struct
      {
         unsigned English:1;                          /*  0 */
         unsigned Absolute:1;                         /*  1 */
         unsigned AccelModeLinear:1;                  /*  2 */
         unsigned AccelModeRate:1;                    /*  3 */
         unsigned RotaryDominant:1;                   /*  4 */
         unsigned MotionContinuous:1;                 /*  5 */
         unsigned InverseCircular:1;                  /*  6 */
         unsigned SpindleStopOnProgHalt:1;            /*  7 */
         unsigned BlockDelete:1;                      /*  8 */
         unsigned OptionalStop:1;                     /*  9 */
         unsigned AccelModeScurve:1;                  /* 10 */
         unsigned MFOLock:1;                          /* 11 */
         unsigned MSOLock:1;                          /* 12 */
         unsigned DryRunFeedRate:1;                   /* 13 */
         unsigned Spare2:1;                            /* 14 */
         unsigned AutoMode:1;                         /* 15 */
         unsigned ProgramFeedRateMPU:1;               /* 16 */
         unsigned ProgramFeedRateUPR:1;               /* 17 */
         unsigned ProgramSFeedRateSurf1:1;            /* 18 */
         unsigned ProgramSFeedRateSurf2:1;            /* 19 */
         unsigned ProgramSFeedRateSurf3:1;            /* 20 */
         unsigned ProgramSFeedRateSurf4:1;            /* 21 */
         unsigned BlockDelete2:1;                     /* 22 */
         unsigned RunOverMode:1;                      /* 23 */
         unsigned MultiBlockLookAhead:1;              /* 24 */
         unsigned HighSpeedLookAhead:1;               /* 25 */
         unsigned MFOActiveOnJog:1;                   /* 26 */
         unsigned WaitForInPos:1;                     /* 27 */
         unsigned Minutes:1;                          /* 28 */
         unsigned Counts:1;                           /* 29 */
         unsigned WaitNone:1;                         /* 30 */
         unsigned Spare:1;                            /* 31 */    // DO NOT USE, DUE TO SIGN BIT PROBLEMS in VB
      } Bit;
   } DW1;
} AER_TASK_MODE;
typedef AER_TASK_MODE *PAER_TASK_MODE;
typedef const AER_TASK_MODE *const PCAER_TASK_MODE;

/*** Parameter types ***************************************************************************/
#define MAX_NUMBER_PARM_TYPES      7
typedef struct tagAER_PARM_TYPES_INFO
{
   LONG     lNumParmTypes;
   LONG     lParmTypes[MAX_NUMBER_PARM_TYPES];
} AER_PARM_TYPES_INFO;
typedef AER_PARM_TYPES_INFO *PAER_PARM_TYPES_INFO;
typedef const AER_PARM_TYPES_INFO *const PCAER_PARM_TYPES_INFO;

/*** Parameters ***************************************************************************/
/* min/max/default values stored here for dist/vel/accel parms are always in "internal inits" (in|deg/sec) */

typedef struct tagAER_PARM_INFO
{
   CHAR     szName[MAX_PARM_NAME_LEN];
   DOUBLE   fdMin;
   DOUBLE   fdMax;
   DWORD    dwAttr;
   DWORD    dwDisplayAttr;
